STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"
#include "ble.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "ble_evt.h"
#include "otp_client.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "esl_profile_ap.h"
#include "time_ref.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
#define ECP_TIMEOUT_MS         (30 * 1000)  // 30 seconds
/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */
  ESL_NOTIFICATION_INFO_RECEIVED_EVT
  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  APP_BLE_ConnStatus_t connStatus;
 
  uint16_t connHdl;

  uint16_t ALLServiceStartHdl;
  uint16_t ALLServiceEndHdl;

  uint16_t GAPServiceStartHdl;
  uint16_t GAPServiceEndHdl;

  uint16_t GATTServiceStartHdl;
  uint16_t GATTServiceEndHdl;

  uint16_t ServiceChangedCharHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;

  /* USER CODE BEGIN BleClientAppContext_t */
  /* Handles of ESL service */
  uint16_t ESLServiceHdl;
  uint16_t ESLServiceEndHdl;

  /* handles of the Tx characteristic - Write To Server */
  /* Handles of ESL Address characteristic */
  uint16_t ESLAddressCharHdl;
  uint16_t ESLAddressValueHdl;
  
  /* Handles of AP Sync Material characteristic */
  uint16_t APSyncKeyMaterialCharHdl;
  uint16_t APSyncKeyMaterialValueHdl;
  
  /* Handles of ESL Resp Key Material characteristic */
  uint16_t ESLRespKeyMaterialCharHdl;
  uint16_t ESLRespKeyMaterialValueHdl;
  
  /* Handles of ESL Current Absolute Time characteristic */
  uint16_t ESLCurrAbsTimeCharHdl;
  uint16_t ESLCurrAbsTimeValueHdl;
  
  /* handles of the Rx characteristic - Notification From Server */  
  /* Handles of ESL Control Point characteristic */
  uint16_t ESLControlPointCharHdl;
  uint16_t ESLControlPointValueHdl;
  uint16_t ESLControlPointCCCDHdl;
    
  /* Handles of ESL Display Information characteristic */
  uint16_t ESLDisplayInfoCharHdl;
  uint16_t ESLDisplayInfoValueHdl;
  
  /* Handles of ESL Image Information characteristic */
  uint16_t ESLImageInfoCharHdl;
  uint16_t ESLImageInfoValueHdl;

  /* Handles of ESL LED Information characteristic */
  uint16_t ESLSensorInfoCharHdl;
  uint16_t ESLSensorInfoValueHdl;
  
  /* Handles of ESL LED Information characteristic */
  uint16_t ESLLedInfoCharHdl;
  uint16_t ESLLedInfoValueHdl;
  
  OTSHandleContext_t OTSHandles;
  
  uint8_t gatt_error_code;
  
  /* ESL Control Point (ECP) timeout timerID*/
  VTIMER_HandleType ECP_timer_Id;    
  
  uint16_t att_mtu;
  uint16_t read_char_len;
  uint8_t read_char[512];
  uint16_t read_char_offset;
  bool b_ECP_failed; 
/* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static BleClientAppContext_t a_ClientContext[CFG_MAX_NUM_CONNECTED_SERVERS];
static uint16_t gattCharValueHdl = 0;

/* USER CODE BEGIN PV */

tListNode esl_bonded;

uint16_t esl_address_conn;      

ESL_PROFILE_KeyMaterial_t ap_sync_key_material_config_value = {
  .Session_Key = {0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x10,0x11,0x12,0x13,0x14,0x15},      //16 bytes
  .IV = {0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07},       //8 bytes
};

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */
extern bool bUpdatingTransition;
/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/

static BLEEVT_EvtAckStatus_t ESL_APP_EventHandler(aci_blecore_event *p_evt);
static void gatt_parse_services(aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_clt_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_clt_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
/* USER CODE BEGIN PFP */
static void context_init(uint8_t index);
static void ESL_AP_write_char(void);
static void ESL_AP_configuring_char(void);
static void ESL_AP_write_esl_address(void);
static void ESL_AP_ECP_Timeout(void *arg);
static void print_Info_Char(void);
static uint8_t ESL_APP_Read_Long_Char(uint16_t ValueHdl, uint16_t Offset);
static ESL_PROFILE_KeyMaterial_t ESL_APP_Return_KeyMaterial_Value(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index = 0;
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */

  /* USER CODE END GATT_CLIENT_APP_Init_1 */

  for(index = 0; index < CFG_MAX_NUM_CONNECTED_SERVERS; index++)
  {
    a_ClientContext[index].connStatus = APP_BLE_IDLE;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  BLEEVT_RegisterGattEvtHandler(ESL_APP_EventHandler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ESL_AP_WRITE_CHARS_ID, UTIL_SEQ_RFU, ESL_AP_write_char);
  
  context_init(0);
  
  TIMEREF_SetAbsoluteTime(0);
  
  OTP_CLIENT_Init();
  
  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

static void context_init(uint8_t index)
{                                   
  memset(&a_ClientContext[index], 0, sizeof(BleClientAppContext_t));
  a_ClientContext[index].state = GATT_CLIENT_APP_IDLE;
  a_ClientContext[index].connHdl = 0xFFFF;
  
  /* When the AP writes to the ECP, the AP shall start a timer with the value 
     set to the ESL Control Point Timeout period (30 seconds). If the timer 
     expires, then the ECP procedure shall be considered to have failed. */
  a_ClientContext[index].ECP_timer_Id.callback = ESL_AP_ECP_Timeout;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

