STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
    case PEER_CONN_HANDLE_EVT :
      /* USER CODE BEGIN PEER_CONN_HANDLE_EVT */
    {  
      uint8_t index = 0;
      
      context_init(index);
      
      a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
      a_ClientContext[index].connHdl = p_Notif->ConnHdl;      
      a_ClientContext[0].att_mtu = 23;      
      OTP_CLIENT_ConnectionComplete(&a_ClientContext[0].OTSHandles, a_ClientContext[0].connHdl);  
    }  
      /* USER CODE END PEER_CONN_HANDLE_EVT */
      break;

    case PEER_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */
    {
      uint8_t index = 0;

      while(index < CFG_MAX_NUM_CONNECTED_SERVERS)
      {
        if(a_ClientContext[index].connHdl == p_Notif->ConnHdl)
        {
          a_ClientContext[index].state = GATT_CLIENT_APP_IDLE;
          a_ClientContext[index].connHdl = 0xFFFF;
          HAL_RADIO_TIMER_StopVirtualTimer(&a_ClientContext[index].ECP_timer_Id);
          
          break;
        }
        index++;
      }
    }
      /* USER CODE END PEER_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN ConnOpcode_Default */

      /* USER CODE END ConnOpcode_Default */
      break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

uint8_t GATT_CLIENT_APP_Get_State(uint8_t index)
{
  return a_ClientContext[index].state;
}

void GATT_CLIENT_APP_Discover_services(uint8_t index)
{
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_CHARS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_DESCS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_ENABLE_ALL_NOTIFICATIONS);
#ifndef PTS_OTP
  if (!bUpdatingTransition)
  {  
    UTIL_SEQ_SetTask( 1u << CFG_TASK_ESL_AP_WRITE_CHARS_ID, CFG_SEQ_PRIO_0);
  }
#endif
  
  return;
}

uint8_t GATT_CLIENT_APP_Procedure_Gatt(uint8_t index, ProcGattId_t GattProcId)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= CFG_MAX_NUM_CONNECTED_SERVERS)
  {
    status = 1;
  }
  else
  {
    status = 0;
    switch (GattProcId)
    {
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

        APP_DBG_MSG("\nGATT services discovery\n");
        result = aci_gatt_clt_disc_all_primary_services(a_ClientContext[index].connHdl, BLE_GATT_UNENHANCED_ATT_L2CAP_CID);

        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
        }
        else
        {
          APP_DBG_MSG("aci_gatt_clt_disc_all_primary_services fail, status 0x%02X\n\n", result);
        }
      }

      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_CHARACS;

        APP_DBG_MSG("\nDiscover all Characteristics (handles [0x%04X - 0x%04X])\n",
                          0x0001,
                          0xFFFF);
        result = aci_gatt_clt_disc_all_char_of_service(
                           a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           0x0001,
                           0xFFFF);
        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
        }
        else
        {
          APP_DBG_MSG("aci_gatt_clt_disc_all_char_of_service fail, status 0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_WRITE_DESC;

        APP_DBG_MSG("\nDiscover all Characteristics Descriptors [0x%04X - 0x%04X]\n",
                         0x0001,
                         0xFFFF);
        result = aci_gatt_clt_disc_all_char_desc(
                           a_ClientContext[index].connHdl,
			   BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           0x0001,
                           0xFFFF);
        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
        }
        else
        {
          APP_DBG_MSG("aci_gatt_clt_disc_all_char_desc fail, status 0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_DESCS */
      case PROC_GATT_ENABLE_ALL_NOTIFICATIONS:
      {
        uint16_t enable; /* Buffer must be kept valid for aci_gatt_clt_write until a gatt procedure complete is received. */
        if (a_ClientContext[index].ServiceChangedCharDescHdl != 0x0000)
        {
          enable = 0x0002;
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].ServiceChangedCharDescHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
          APP_DBG_MSG(" ServiceChangedCharDescHdl =0x%04X\n",a_ClientContext[index].ServiceChangedCharDescHdl);
        }
        /* USER CODE BEGIN PROC_GATT_ENABLE_ALL_NOTIFICATIONS */
        if(a_ClientContext[index].ESLControlPointCCCDHdl != 0x0000)
        {
          enable = 0x0001;
          APP_DBG_MSG("Enable notifications on ECP (handle 0x%04X)\n", a_ClientContext[index].ESLControlPointCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].ESLControlPointCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        if(a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl != 0x0000)
        {
          enable = 0x0002;
          APP_DBG_MSG("Enable indications on OACP (handle 0x%04X)\n", a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        if(a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl != 0x0000)
        {
          enable = 0x0002;
          APP_DBG_MSG("Enable indications on OLCP (handle 0x%04X)\n", a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        /* USER CODE END PROC_GATT_ENABLE_ALL_NOTIFICATIONS */

        if ((result == BLE_STATUS_SUCCESS) && (a_ClientContext[0].gatt_error_code == 0))
        {
          APP_DBG_MSG("Notifications enabled successfully\n");
        }
        else
        {
          APP_DBG_MSG("Enabling notifications failed, status 0x%02X, gatt error code=0x%02X\n", result, a_ClientContext[0].gatt_error_code);
        }
        a_ClientContext[0].gatt_error_code = 0;
      }
      break; /* PROC_GATT_ENABLE_ALL_NOTIFICATIONS */
    default:
      break;
    }
  }

