STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
  return status;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static BLEEVT_EvtAckStatus_t ESL_APP_EventHandler(aci_blecore_event *p_evt)
{
  BLEEVT_EvtAckStatus_t return_value = BLEEVT_NoAck;
  GATT_CLIENT_APP_Notification_evt_t Notification;
  UNUSED(Notification);

  return_value = BLEEVT_NoAck;

  switch (p_evt->ecode)
  {
    case ACI_ATT_CLT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_services((aci_att_clt_read_by_group_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE */
  case ACI_ATT_CLT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt_rsp = (void*) p_evt->data;
      gatt_parse_services_by_UUID((aci_att_clt_find_by_type_value_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_READ_BY_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_chars((aci_att_clt_read_by_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_FIND_INFO_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_info_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_descs((aci_att_clt_find_info_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_INFO_RESP_VSEVT_CODE */
    case ACI_GATT_CLT_NOTIFICATION_VSEVT_CODE:
    {
      aci_gatt_clt_notification_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_notification((aci_gatt_clt_notification_event_rp0 *)p_evt_rsp);
    }
    break;/* ACI_GATT_NOTIFICATION_VSEVT_CODE */
  case ACI_GATT_CLT_INDICATION_VSEVT_CODE:
    {
      aci_gatt_clt_indication_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      
      APP_DBG_MSG("ACI_GATT_CLT_INDICATION_VSEVT_CODE\n");
      if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].ServiceChangedCharValueHdl)
      {
        APP_DBG_MSG("Service Changed Indication\n");
        
        UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);
      }      
      else if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].OTSHandles.ObjListCPValueHdl)
      {
        return_value = BLEEVT_Ack;
        
        OTP_CLIENT_OLCPIndication(p_evt_rsp->Attribute_Value, p_evt_rsp->Attribute_Value_Length);
      }
      else if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].OTSHandles.ObjActionCPValueHdl)
      {
        return_value = BLEEVT_Ack;
        
        OTP_CLIENT_OACPIndication(p_evt_rsp->Attribute_Value, p_evt_rsp->Attribute_Value_Length);
      }
      
      aci_gatt_clt_confirm_indication(p_evt_rsp->Connection_Handle, p_evt_rsp->CID);
    }
    break;    
    case ACI_GATT_CLT_PROC_COMPLETE_VSEVT_CODE:
    {
      aci_gatt_clt_proc_complete_event_rp0 *p_evt_rsp = (void*)p_evt->data;

      uint8_t index = 0;
      
      gatt_cmd_resp_release();
      a_ClientContext[index].gatt_error_code = p_evt_rsp->Error_Code;
      APP_DBG_MSG("GATT procedure complete: 0x%02x\n", p_evt_rsp->Error_Code);
    }
    break;/* ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
    case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
    {
      aci_gatt_tx_pool_available_event_rp0 *tx_pool_available;
      tx_pool_available = (aci_gatt_tx_pool_available_event_rp0 *)p_evt->data;
      UNUSED(tx_pool_available);
      /* USER CODE BEGIN ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
      UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_TX_POOL_AVAILABLE_EVENT);
      /* USER CODE END ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
    }
    break;/* ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE*/
    case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
    {
      aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
      exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  MTU exchanged size = %d\n",exchange_mtu_resp->MTU );
      a_ClientContext[0].att_mtu = exchange_mtu_resp->MTU;
      /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */

      /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
    }
    break;
    /* USER CODE BEGIN BLECORE_EVT */
    case ACI_GATT_CLT_ERROR_RESP_VSEVT_CODE:
    {  
      aci_gatt_clt_error_resp_event_rp0 * clt_error_resp;
      clt_error_resp = (aci_gatt_clt_error_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  GATT Error Response code: 0x%02x \n", clt_error_resp->Error_Code);
      UNUSED(clt_error_resp);
    }
    break; 
    
    case ACI_ATT_CLT_READ_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_resp_event_rp0 * clt_read_resp;
      clt_read_resp = (aci_att_clt_read_resp_event_rp0 *)p_evt->data;
      //APP_DBG_MSG("  GATT Read Response length: 0x%02x \n", clt_read_resp->Event_Data_Length);
      a_ClientContext[0].read_char_len = clt_read_resp->Event_Data_Length;
      memcpy(a_ClientContext[0].read_char, clt_read_resp->Attribute_Value, a_ClientContext[0].read_char_len);
      a_ClientContext[0].read_char_offset = a_ClientContext[0].read_char_len;
    }    
    break;
    
    case ACI_ATT_CLT_READ_BLOB_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_blob_resp_event_rp0 * clt_read_resp;
      clt_read_resp = (aci_att_clt_read_blob_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  GATT Read Blob Response length: 0x%02x \n", clt_read_resp->Event_Data_Length);
      a_ClientContext[0].read_char_len += clt_read_resp->Event_Data_Length;
      memcpy(a_ClientContext[0].read_char + a_ClientContext[0].read_char_offset, clt_read_resp->Attribute_Value, a_ClientContext[0].read_char_len);
      a_ClientContext[0].read_char_offset = a_ClientContext[0].read_char_len;
    }
    break;
    /* USER CODE END BLECORE_EVT */
    default:
      break;
  }/* end switch (p_evt->ecode) */

  return(return_value);
}

__USED static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif)
{
  /* USER CODE BEGIN gatt_Notification_1*/

