STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
  esl_node = Search_by_Peer_address_In_List(Peer_Address, Peer_Address_Type);
  if(esl_node == NULL)  
  {  
    esl_node = (esl_bonded_t *)malloc(sizeof(esl_bonded_t));

    for (uint8_t i = 0; i < 6; i++)
      esl_node->esl_info.Peer_Address[i] = Peer_Address[i];
    esl_node->esl_info.Peer_Address_Type = Peer_Address_Type;
    
    esl_node->esl_info.state = ESL_STATE_CONFIGURING;
    esl_node->esl_info.esl_address = esl_address;
    esl_node->esl_info.esl_resp_key_material = ESL_APP_Return_KeyMaterial_Value();    
    
    if(esl_node != NULL) 
    {  
      LST_insert_tail(&esl_bonded, &esl_node->esl_queue);
    }  
  }
  else
  {     
    APP_DBG_MSG("The ESL device is already present in bonded device list!\n");
  }  
  //To save the address of the connected ESL to be used to identify esl_node when writing characters
  esl_address_conn = esl_node->esl_info.esl_address;
  
  esl_node->esl_info.Conn_Handle = Conn_Handle;
  
  display_all_ESL_bonded(&esl_bonded);
  return true;
}

void ESL_AP_Remove_ESL_from_List(esl_bonded_t * esl_node)
{
  APP_DBG_MSG("!!! ESL_AP_Remove_ESL_from_List\n");
  aci_gap_remove_bonded_device(esl_node->esl_info.Peer_Address_Type, esl_node->esl_info.Peer_Address);
  LST_remove_node(&esl_node->esl_queue);
  free(esl_node);
}

void display_all_ESL_bonded(tListNode *list_head_p)
{
  esl_bonded_t *current_node_p;
  
  current_node_p = (esl_bonded_t *)list_head_p->next;
  APP_DBG_MSG("List of ESL bonded device: \n");

  while (&current_node_p->esl_queue != list_head_p)
  {
      APP_DBG_MSG("Peer Address: ");
      for (int i = 5; i >=0; i--) {
          APP_DBG_MSG("%02X", current_node_p->esl_info.Peer_Address[i]);
          if (i > 0) APP_DBG_MSG(":");
      }
      APP_DBG_MSG(", State: %d, ESL Address: %04X\n", current_node_p->esl_info.state, current_node_p->esl_info.esl_address);
      LST_get_next_node(&current_node_p->esl_queue, (tListNode **)&current_node_p);
  }
}

/* Search by Peer address and return an ESL node on the list */
esl_bonded_t* Search_by_Peer_address_In_List(uint8_t peerAddress[6], uint8_t Peer_Address_Type)
{  
  tListNode *list_head_p;
  esl_bonded_t *current_node_p;

  list_head_p = &esl_bonded;
  current_node_p = (esl_bonded_t *)list_head_p->next;
  
  while (&current_node_p->esl_queue != list_head_p)
  {
    if ((memcmp(current_node_p->esl_info.Peer_Address, peerAddress, sizeof(current_node_p->esl_info.Peer_Address)) == 0) &&
       (Peer_Address_Type == current_node_p->esl_info.Peer_Address_Type))
    {
        // return the esl_node related to peerAddress
        return current_node_p;
    }
    LST_get_next_node(&current_node_p->esl_queue, (tListNode **)&current_node_p);
  }
//  APP_DBG_MSG("Node with Peer address ");
//  for (int i = 5; i >= 0; i--) {
//      APP_DBG_MSG("%02X", peerAddress[i]);
//      if (i > 0) APP_DBG_MSG(":");
//  }
//  APP_DBG_MSG(" not present in ESL bonded list.\n");
  return NULL;
}

/* Search by ESL address and return an ESL node on the list */
esl_bonded_t* Search_by_ESL_address_In_List(uint16_t esl_address)
{  
  tListNode *list_head_p;
  esl_bonded_t *current_node_p;

  list_head_p = &esl_bonded;
  current_node_p = (esl_bonded_t *)list_head_p->next;

  while (&current_node_p->esl_queue != list_head_p)
  {
    if (current_node_p->esl_info.esl_address == esl_address)
    {
        // return the esl_node related to esl_address
        return current_node_p;
    }
    LST_get_next_node(&current_node_p->esl_queue, (tListNode **)&current_node_p);
  }
  APP_DBG_MSG("Node with ESL address %04X not found.\n", esl_address);
  return NULL;
}

/* Search by Connection Handle and return an ESL node on the list */
esl_bonded_t* Search_by_Conn_Handle_In_List(uint16_t conn_handle)
{  
  tListNode *list_head_p;
  esl_bonded_t *current_node_p;

  list_head_p = &esl_bonded;
  current_node_p = (esl_bonded_t *)list_head_p->next;

  while (&current_node_p->esl_queue != list_head_p)
  {
    if (current_node_p->esl_info.Conn_Handle == conn_handle)
    {
        // return the esl_node related to conn_handle
        return current_node_p;
    }
    LST_get_next_node(&current_node_p->esl_queue, (tListNode **)&current_node_p);
  }
  APP_DBG_MSG("Node with Connection Handle %04X not found.\n", conn_handle);
  return NULL;
}

uint16_t ESL_AP_return_ESL_address(uint8_t group_id, uint8_t esl_id)
{
  uint16_t esl_addr;
  
  esl_addr = (group_id << 8) | (esl_id & 0x00FF);
  return(esl_addr);
}

/* Return an ESL bonded to AP given the Group_ID and ESL_ID*/
esl_bonded_t* ESL_AP_return_ESL_bonded(uint8_t group_id, uint8_t esl_id)
{
  uint16_t esl_address;  
  esl_bonded_t* esl_device;   
 
  // return ESL_addres by group_id and esl_id
  esl_address = ESL_AP_return_ESL_address(group_id, esl_id);
  
  // return the esl_node using Search_by_ESL_address_In_List     
  esl_device = Search_by_ESL_address_In_List(esl_address);

  return esl_device;
}

/* Update ESL queue with info written on characteristics during configuration */
void Update_Info_to_ESL_queue(esl_bonded_t* esl_node, ESL_Profile_Context_t new_info, ESL_PROFILE_KeyMaterial_t new_ap_sync_key_material) 
{
  esl_node->esl_info.state = new_info.state;
  esl_node->esl_info.esl_address = new_info.esl_address;
  esl_node->esl_info.esl_resp_key_material = new_info.esl_resp_key_material;

  APP_DBG_MSG("ESL Node Updated.\n");
}

static void ESL_AP_write_char(void)
{ 
  switch (get_AP_Status())
  {
    case ESL_AP_CONFIGURING_ESL:
      {
        ESL_APP_Read_All_Info_Chars();
        ESL_AP_configuring_char();
      }
      break;
    case ESL_AP_UPDATING_ESL_ADDRESS:
      {
        ESL_AP_write_esl_address();
      }
      break;  
  }    
    
}

/* If the AP establish a bond with an ESL and ESL is on Configuring state,
   the AP can configure ESL by writing some ESL Service characteristics  
   (called on ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE) */
static void ESL_AP_configuring_char(void)
{
  uint8_t index = 0;
  esl_bonded_t *esl_node;
  uint8_t key[24];
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;  
  
  //APP_DBG_MSG("ESL_AP_write_char!\n");
  esl_node = Search_by_ESL_address_In_List(esl_address_conn);
  if (esl_node != NULL)
  {
  
    /* ESL Address characteristic */
    APP_DBG_MSG("Writing ESL Address (0x%04X)\n", esl_node->esl_info.esl_address);
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].ESLAddressValueHdl,
                             2,
                             (uint8_t *)&esl_node->esl_info.esl_address); 
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLAddressValueHdl);
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();   
    }
    
    //AP Sync Material characteristic
    APP_DBG_MSG("Writing AP Sync Material\n");
    memcpy(&key[0], ap_sync_key_material_config_value.Session_Key, 16);
    memcpy(&key[16], ap_sync_key_material_config_value.IV, 8);
    
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].APSyncKeyMaterialValueHdl,
                             24,
                             key); 
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].APSyncKeyMaterialValueHdl);
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();     
    }
    
    //ESL Resp Key Material characteristic
    APP_DBG_MSG("Writing Response Key Material\n");      
    memcpy(&key[0], esl_node->esl_info.esl_resp_key_material.Session_Key, 16);
    memcpy(&key[16], esl_node->esl_info.esl_resp_key_material.IV, 8);
    
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].ESLRespKeyMaterialValueHdl,
                             24,
                             key); //ESL Resp Key Material
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLRespKeyMaterialValueHdl);
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();
    }
    
