STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
    /* ESL Current Absolute Time characteristic */  
    uint32_t absoluteTime = TIMEREF_GetCurrentAbsTime();
    APP_DBG_MSG("Writing Absolute time (%d)\n", absoluteTime);  
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].ESLCurrAbsTimeValueHdl,
                             4,
                             (uint8_t *)&absoluteTime);
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLCurrAbsTimeValueHdl);
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();     
    }
 
    Update_Info_to_ESL_queue(esl_node, esl_node->esl_info, ap_sync_key_material_config_value);

    esl_node->esl_info.state = ESL_STATE_CONFIGURING;  
      
    /* After configuration of the ESL has been completed, the AP shall send the Update Complete opcode (0x04)
       using the ESL Control Point characteristic and shall commence the Periodic Advertising Synchronization
       Transfer (PAST) procedure */
    
    APP_DBG_MSG("Sending Update Complete\n");
    ret = ESL_AP_send_Update_Complete_cmd(esl_node->esl_info.esl_address);  
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Update Complete command failed: 0x%02X \n", ret);
    }
    else
    {
      APP_DBG_MSG("Update Complete command success! (Configuring state) \n");
    }
    
    // Start PAST procedure (call "periodic_sync_info_transfer")
    UTIL_SEQ_SetTask( 1U << CFG_TASK_START_INFO_TRANSFER, CFG_SEQ_PRIO_0);
    
    esl_node->esl_info.state = ESL_STATE_SYNCHRONIZED;
  }  
  return;
}

uint8_t ESL_AP_send_Update_Complete_cmd(uint16_t esl_address)
{
  uint8_t cmd[2];
  uint8_t esl_id = (esl_address & 0x00FF);
  
  cmd[0] = ESL_CMD_UPDATE_COMPLETE;
  cmd[1] = esl_id;
  return ESL_AP_write_ECP(cmd, 2, NULL, false); //No response 
}

/* If bResponse is true the command wait for an ESL response, else the 
   command has no response, so the timer ECP_TIMEOUT_MS must not start */
uint8_t ESL_AP_write_ECP(uint8_t* cmd, uint8_t len_cmd, uint16_t* conn_handle, bool bResponse)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index = 0;
  
  /* If an ECP procedure times out, then the AP shall not start a new ECP 
   procedure until a new link is established with the ESL.*/
  if(!a_ClientContext[index].b_ECP_failed)
  {
    if (conn_handle!= NULL)
      *conn_handle = a_ClientContext[index].connHdl;
    
    APP_DBG_MSG("Writing ECP\n");
    
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           a_ClientContext[index].ESLControlPointValueHdl,
                           len_cmd,
                           cmd);
    
    if (ret != BLE_STATUS_SUCCESS)
    {  
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLControlPointValueHdl);
      return ret;
    }
    /* wait until a gatt procedure complete is received */
    gatt_cmd_resp_wait();
    
    if(a_ClientContext[index].gatt_error_code != 0)
    {
      APP_DBG_MSG(" Procedure failed with gatt_error_code = 0x%02X\n",
                  a_ClientContext[index].gatt_error_code);
      return a_ClientContext[index].gatt_error_code;
    }
   
    /* When the AP writes to the ECP, the AP shall start a timer with the value  
       set to the ESL Control Point Timeout period.*/
    if (bResponse)
      HAL_RADIO_TIMER_StartVirtualTimer(&a_ClientContext[index].ECP_timer_Id, ECP_TIMEOUT_MS);
  }  
  return ret;
}

static void ESL_AP_write_esl_address(void)
{
  uint8_t index = 0;
  uint16_t new_esl_address;
  esl_bonded_t *esl_node;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  new_esl_address = ESL_AP_New_esl_address();
  
  /* ESL Address characteristic */
  ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           a_ClientContext[index].ESLAddressValueHdl,
                           2,
                           (uint8_t *)&new_esl_address); 
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("New ESL_address aci_gatt_clt_write failed, connHdl=0x%04X, ValueHdl=0x%04X\n",  
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ESLAddressValueHdl);
  }
  else
  {
    /* wait until a gatt procedure complete is received */
    gatt_cmd_resp_wait();    
    APP_DBG_MSG("New ESL_address 0x%04X aci_gatt_clt_write success, connHdl=0x%04X, ValueHdl=0x%04X\n",
                new_esl_address,              
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ESLAddressValueHdl);
  }
  
  esl_node = ESL_AP_return_ESL_to_Update();
  if (esl_node != NULL)
  { 
    esl_node->esl_info.esl_address = new_esl_address;
    esl_node->esl_info.state = ESL_STATE_UPDATING;
  }
  
  ret = ESL_AP_send_Update_Complete_cmd(new_esl_address);  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Update Complete command failed: 0x%02X \n", ret);
  }
  else
  {
    APP_DBG_MSG("Update Complete command success! (Reconf command) \n");
  }
  // Start PAST procedure (call "periodic_sync_info_transfer")
  UTIL_SEQ_SetTask( 1U << CFG_TASK_START_INFO_TRANSFER, CFG_SEQ_PRIO_0);
  esl_node->esl_info.state = ESL_STATE_SYNCHRONIZED;
}

static void ESL_AP_ECP_Timeout(void *arg)
{  
  APP_DBG_MSG("ECP procedure failed\n");
  /* If an ECP procedure times out, then the AP shall not start a new ECP 
     procedure until a new link is established with the ESL.*/
  set_ECP_Failed(true);
}

void set_ECP_Failed(bool bValue)
{
  uint8_t index = 0;
  
  a_ClientContext[index].b_ECP_failed = bValue;
}

void ESL_APP_DisconnectionComplete(uint16_t conn_handle)
{
  esl_bonded_t * esl_node;
  
  esl_node = Search_by_Conn_Handle_In_List(conn_handle);
  if(esl_node != NULL)  
  {
    if(esl_node->esl_info.state == ESL_STATE_CONFIGURING)
    {
      /* If link loss occurs before configuration of the ESL has been completed, 
         the AP should not commence the PAST procedure and should attempt to 
         reconnect to the ESL to continue the configuration. */
         
      /* When link loss occurs before configuration of the ESL has been completed,  
         the ESL reverts to the Unassociated state */
      esl_node->esl_info.state = ESL_STATE_UNASSOCIATED;
      APP_DBG_MSG("Unassociated State transition for link loss\n ");
    }
    else if(esl_node->esl_info.state == ESL_STATE_UPDATING)
    {
      /* If the connection is lost owing to link loss occurring in the Updating state, 
         then the ESL shall transition to the Unsynchronized state */
      esl_node->esl_info.state = ESL_STATE_UNSYNCHRONIZED;
      APP_DBG_MSG("Usynchronized State transition for link loss\n ");      
    }
  }
  
  OTP_CLIENT_DisconnectionComplete();
}

void ESL_APP_ReconnectionStateTransition(uint8_t Peer_Address[6], uint8_t Peer_Address_Type)
{
  esl_bonded_t * esl_node;
  
