STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
  esl_node = Search_by_Peer_address_In_List(Peer_Address, Peer_Address_Type);
  if(esl_node != NULL)  
  {
    if(esl_node->esl_info.state == ESL_STATE_UNSYNCHRONIZED)
    {
      esl_node->esl_info.state = ESL_STATE_UPDATING;
      APP_DBG_MSG("Updating State transition from Unsynchronized state\n ");
    }
  }    
}

static void print_Info_Char(void)
{
  for (int i = 0; i < a_ClientContext[0].read_char_len; i++) 
  {
    APP_DBG_MSG("%02X", a_ClientContext[0].read_char[i]);
    if (i < a_ClientContext[0].read_char_len-1) 
      APP_DBG_MSG(":");
  }    
  APP_DBG_MSG("\n");
}

uint8_t ESL_APP_Read_All_Info_Chars(void)
{
  tBleStatus ret = 0;
  
//  APP_DBG_MSG("ESL_AP_Read_Info_Chars!\n");
  
  APP_DBG_MSG("\nRead Display Information\n");  
  ESL_APP_Read_Display_Info_Chars(); 
  
  APP_DBG_MSG("\nRead Image Information\n");  
  ESL_APP_Read_Image_Info_Chars();
  
  APP_DBG_MSG("\nRead Sensor Information\n");  
  ESL_APP_Read_Sensor_Info_Chars();
  
  APP_DBG_MSG("\nRead LED Information\n");  
  ESL_APP_Read_Led_Info_Chars();
  
  return ret;
}
  

uint8_t ESL_APP_Read_Display_Info_Chars(void)
{
  uint8_t index = 0;

  return ESL_APP_Read_Info_Char(a_ClientContext[index].ESLDisplayInfoValueHdl); 
}

uint8_t ESL_APP_Read_Image_Info_Chars(void)
{
  uint8_t index = 0;

  return ESL_APP_Read_Info_Char(a_ClientContext[index].ESLImageInfoValueHdl); 
}

uint8_t ESL_APP_Read_Sensor_Info_Chars(void)
{
  uint8_t index = 0;

  return ESL_APP_Read_Info_Char(a_ClientContext[index].ESLSensorInfoValueHdl); 
}

uint8_t ESL_APP_Read_Led_Info_Chars(void)
{
  uint8_t index = 0;

  return ESL_APP_Read_Info_Char(a_ClientContext[index].ESLLedInfoValueHdl); 
}

uint8_t ESL_APP_Clear_Security_DB(void)
{
  APP_DBG_MSG("Clear Security DB!\n");
  return aci_gap_clear_security_db(); 
}

uint8_t ESL_APP_Read_Info_Char(uint16_t ValueHdl)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  //APP_DBG_MSG("ESL_AP_Read_Info_Chars!\n");
  
  a_ClientContext[index].read_char_offset = 0;

  /* Display Information characteristic */
  ret = aci_gatt_clt_read(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_read, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[index].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  if (a_ClientContext[0].read_char_len >= (a_ClientContext[0].att_mtu - 1))
  {
    /* Display Information characteristic Read long */
    ret = ESL_APP_Read_Long_Char(ValueHdl, a_ClientContext[0].read_char_len);
  }  
  print_Info_Char();
  
  return ret;
}

static uint8_t ESL_APP_Read_Long_Char(uint16_t ValueHdl, uint16_t Offset)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  APP_DBG_MSG("Read Long\n");

  ret = aci_gatt_clt_read_long(a_ClientContext[index].connHdl,
                               BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                               ValueHdl,
                               Offset); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read_long failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                ValueHdl);
    return ret;
  }
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();  
  APP_DBG_MSG("aci_gatt_clt_read_long, connHdl=0x%04X, ValueHdl=0x%04X\n",
              a_ClientContext[index].connHdl,
              ValueHdl);
  
  return a_ClientContext[0].gatt_error_code;  
}

static ESL_PROFILE_KeyMaterial_t ESL_APP_Return_KeyMaterial_Value(void) 
{
    ESL_PROFILE_KeyMaterial_t keyMaterial;

    hci_le_rand(&keyMaterial.Session_Key[0]);
    hci_le_rand(&keyMaterial.Session_Key[8]);

    hci_le_rand(&keyMaterial.IV[0]);

    return keyMaterial;
}

tBleStatus GATT_CLIENT_Read_Char(uint16_t ValueHdl, uint8_t **data_p, uint16_t *data_length_p)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  a_ClientContext[0].read_char_offset = 0;

  ret = aci_gatt_clt_read(a_ClientContext[0].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[0].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_read, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[0].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  if (a_ClientContext[0].read_char_len >= (a_ClientContext[0].att_mtu - 1))
  {
    ret = ESL_APP_Read_Long_Char(ValueHdl, a_ClientContext[0].read_char_len);
  }
  
  *data_p = a_ClientContext[0].read_char;
  *data_length_p = a_ClientContext[0].read_char_len;
  
  //TODO: check if ESL_APP_Read_Long_Char returned "Attribute Not Long".
  
  return ret;
}

tBleStatus GATT_CLIENT_Write_Char(uint16_t ValueHdl, uint8_t *data, uint16_t data_length)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  a_ClientContext[0].gatt_error_code = 0;

  ret = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl,
                           data_length,
                           data); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_write failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[0].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_write, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[0].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  return a_ClientContext[0].gatt_error_code;
}

/* USER CODE END LF */

